'''
1.Распарсить нужные поля из user.json
    1.1 Используем менеджер контекста для открытия файла
    1.2 Используем генераторы для чтения файла
    1.3 Куда-то складываем результат
2.распарсить нужные поля из books.csv
    2.1 Используем менеджер контекста для открытия файла
    2.2 Используем генераторы для чтения файла
    2.3 Куда-то складываем результат
3.Склеить их и положить в  result.json
'''

import json

with open("./src/users.json", 'r') as f:
    users = json.loads(f.read(),)
print(type(users))
